Attribute VB_Name = "Mdl_exe0905otn"
Option Explicit

'----------------------------------------
'Q0905_1｜「★」×n の文字列
'----------------------------------------
'状況: 入力した数だけ★を並べたい
'ねらい: 入力処理とループ
'指示: ユーザーが入力した数だけ「★」を並べて表示しなさい
' 「いくつ★を表示しますか？」と聞く
'----------------------------------------
Sub Q0905_1()
    Dim str As String, i As Long, star As String
    str = InputBox("いくつ★を表示しますか？")
    For i = 1 To str
        star = star + "★"
    Next i
    MsgBox star
    
End Sub



'Q0905_2｜「★☆★☆★」の文字列
'----------------------------------------
'状況: ★と☆を交互に並べたい
'ねらい: ループとIf
'指示: 「★☆★☆★」を作って表示しなさい
'----------------------------------------
Sub Q0905_02()
    Dim i As Long, str As String, star As String
    str = InputBox()
End Sub


'----------------------------------------
'Q0905_03｜シートに★を横に並べる
'----------------------------------------
'状況: シート上に★を横方向に並べたい
'ねらい: Cellsの利用、ループ
'指示: A1～E1に「★」を表示しなさい
'----------------------------------------



'----------------------------------------
'Q0905_04｜シートに★☆を交互に表示
'----------------------------------------
'状況: シート上に★と☆を交互に並べたい
'ねらい: ループ＋If
'指示: A1～A5に「★」「☆」を交互に表示しなさい
'----------------------------------------
